import 'package:electronic_election/shared/BottomBar.dart';
import 'package:electronic_election/shared/drawer_widget.dart';
import 'package:flutter/material.dart';

import 'contact_us.dart';
import 'home_page.dart';

class IntroPage extends StatelessWidget {
  final GlobalKey<ScaffoldState> scaffoldKey = GlobalKey<ScaffoldState>();


   IntroPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Directionality(
      textDirection: TextDirection.rtl,

      child: WillPopScope(
        onWillPop: () async {
          Navigator.pushNamedAndRemoveUntil(context, '/home', (route) => false);
          return false; // Do not allow the default back button behavior
        },
        child: Scaffold(
          key: scaffoldKey,
          appBar: AppBar(
            title: const Text('عن الهيئة'),
            backgroundColor: Colors.redAccent,
            toolbarHeight: 70,// Change the color to your preference
          ),
          body:  SingleChildScrollView(
            child : Padding(
              padding: const EdgeInsets.all(16.0),
              child: Column(
                crossAxisAlignment: CrossAxisAlignment.start,
                children: [
                  const SizedBox(height: 16.0),
                  const Text(
                    'تعريف بالهيئة',
                    style: TextStyle(fontSize: 24.0),
                  ),
                  const SizedBox(height: 16.0),
                  const Divider(color: Colors.black, height: 10),
                  const SizedBox(height: 32.0),
                  Text(
                    '''أنشئت الهيئة الوطنية للانتخابات في جمهورية مصر العربية إعمالا لنصوص دستور 2014 والذي نصت المادة 208 منه على إنشاء الهيئة كهيئة مستقلة، تختص دون غيرها بإدارة الاستفتاءات، والانتخابات الرئاسية، والنيابية، والمحلية، بدءا من إعداد قاعدة بيانات الناخبين وتحديثها، واقتراح تقسيم الدوائر، وتحديد ضوابط الدعاية والتمويل، والإنفاق الانتخابي، والإعلان عنه، والرقابة عليها، وتيسير إجراءات تصويت المصريين المقيمين في الخارج، وغير ذلك من الإجراءات حتى إعلان النتيجة. وذلك كله على النحو الذي ينظمه القانون.

          وقد نصت المادة 209 من الدستور على تشكيل مجلس إدارة الهيئة من عشرة أعضاء من القضاء والجهات والهيئات القضائية في مصر، وأن يتم اختيارهم بموجب ندبهم من هذه الجهات والهيئات القضائية (دون تدخل من السلطة التنفيذية)، وأن يترأس هذه الهيئة أقدم أعضائها من محكمة النقض.

            كما أوجبت أن يكون للهيئة جهاز تنفيذي دائم يحدد القانون تشكيله، ونظام العمل به، وحقوق وواجبات أعضائه وضماناتهم، بما يحقق لهم الحياد والاستقلال والنزاهة.

        ويتولى إدارة الاقتراع، والفرز في الاستفتاءات، والانتخابات أعضاء تابعون للهيئة تحت إشراف مجلس إدارتها، ولها أن تستعين بأعضاء من الهيئات القضائية.

        وقد أوجبت المادة 210 من الدستور أن يتم الاقتراع، والفرز في الانتخابات، والاستفتاءات التي تجرى في السنوات العشر التالية لتاريخ العمل بدستور 2014 (أي حتى 2024)، تحت إشراف كامل من أعضاء الجهات والهيئات القضائية.

          وتخضع قرارات الهيئة بما في ذلك قرارات إعلان نتائج الانتخابات والاستفتاءات لإمكانية الطعن القضائي عليها، حيث أناطت المادة المذكورة بالمحكمة الإدارية العليا اختصاص الفصل في الطعون على قرارات الهيئة المتعلقة بالاستفتاءات والانتخابات الرئاسية والنيابية ونتائجها، بينما أناطت بمحكمة القضاء الإداري اختصاص الفصل في الطعون على انتخابات المحليات .

      وفي إطار الظهير الدستوري سالف الذكر صدر القانون رقم 198 لسنة 2017 بشأن الهيئة الوطنية للانتخابات ونشر بالجريدة الرسمية في العدد 30 مكرر (ب) بتاريخ 1/8/2017 – وعلى أن يعمل به اعتبارا من تاريخ 2/8/2017 .

    وتتمثل أبرز أحكام هذا القانون فيما يلي :

    - النص على الاستقلال الفني والمالي والادارى للهيئة.

    - النص على التزام الهيئة بالإشراف على الانتخابات والاستفتاءات باستقلالية وحيادية تامة وإنه لا يجوز التدخل في أعمالها أو اختصاصاتها.

    - ضمان الهيئة لحق الاقتراع لكل ناخب.

    - التزام الهيئة بالمساواة بين جميع الناخبين والمترشحين خلال الاستفتاءات والانتخابات.

    - تنظيم كيفية الطعن علي قرارات الهيئة أمام القضاء.

    - النص على ضمان استقلال وحياد رئيس ونواب وأعضاء الجهاز التنفيذي للهيئة وعدم انتماء أي منهم لأي ائتلاف أو حزب سياسي.

    - النص على التزام رئيس وأعضاء مجلس إدارة الهيئة ورئيس الجهاز التنفيذي ونوابه وأعضاءه والعاملين بالهيئة بعدم قيام أي حالة من حالات تضارب المصالح في حقهم.''',

                    style: TextStyle(
                        fontSize: 18.0,
                        color: Colors.grey.shade600
                    ),
                  ),
                  const SizedBox(height: 32.0),
                  Text(
                    '''أهم سلطات الهيئة:

حتى تتمكن الهيئة من القيام بمهامها فقد زودها المشرع بالعديد من الاختصاصات ، أهمها ما يلي :

- تنفيذ عملية الاستفتاءات والانتخابات، وفق ا لأحكام القوانين، وطبقا للأسس والقواعد المتعارف عليها دوليا (والقوانين المشار إليها تتمثل بصفة أساسية في قانون الهيئة وقانون مباشرة الحقوق السياسية وقانون الانتخابات الرئاسية وقانون مجلس النواب وقانون الإدارة المحلية)

- إعداد قاعدة بيانات الناخبين من واقع بيانات الرقم القومي، وتحديثها وتعديلها وتنقيتها ومراجعتها بصفة دورية مستمرة.

- دعوة الناخبين للاستفتاءات والانتخابات، وتحديد مواعيدها، ووضع الجدول الزمني لكل منها.

- فتح باب الترشح، وتحديد المواعيد الخاصة به، والإجراءات والمستندات والأوراق المطلوب تقديمها عند الترشيح.

- تلقي طلبات الترشح، وفحصها، والتحقق من استيفائها للشروط المطلوبة، والبت فيها، وإعلان أسماء المترشحين.

- وضع قواعد سير عملية الاستفتاءات والانتخابات وإجراءاتها وآلياتها، بما يضمن سلامتها وحيدتها ونزاهتها وشفافيتها.

- ندب الأعضاء لإدارة عملية الاقتراع والفرز في الاستفتاءات والانتخابات.

- تحديد مراكز الاقتراع والفرز ومقارها، والقائمين عليها، وتوزيع الأعضاء.

- إصدار القرارات اللازمة لحفظ النظام والأمن أثناء الاستفتاءات والانتخابات، داخل اللجان وخارجها.

- وضع القواعد المنظمة لإجراءات عملية تصويت المصريين المقيمين بالخارج في الاستفتاءات والانتخابات بما يتفق والأوضاع الخاصة بهم، وتحديد مقار هذه اللجان وعددها، والقائمين عليها، وذلك كله مع توفير الضمانات التي تكفل نزاهة عملية الاستفتاءات أو الانتخابات وحيادها.

- تحديد ضوابط الدعاية الانتخابية، والتمويل والإنفاق الانتخابي والإعلان عنه، والرقابة عليها.

- تحديد تاريخ بدء الحملة الانتخابية ونهايتها.

- وضع القواعد المنظمة لمتابعة الاستفتاءات والانتخابات من جانب وسائل الإعلام ومنظمات المجتمع المدني المصرية والأجنبية، وغيرها، ووكلاء المترشحين، ومراقبة مدى الالتزام بتلك القواعد.

- وضع القواعد المنظمة لاستطلاعات الرأي المتعلقة بالاستفتاءات والانتخابات، وكيفية إجرائها، ومواعيدها، والإعلان عنها.

- توعية وتثقيف الناخبين والأحزاب والائتلافات السياسية بأهمية المشاركة في الاستفتاءات والانتخابات، وحقوقهم وواجباتهم، ويجوز لها أن تستعين في ذلك بالمجالس القومية، ومنظمات المجتمع المدني، والنقابات المهنية والعمالية، ووسائل وأجهزة الإعلام، وغيرها.

- إعداد القائمة النهائية للمترشحين وإعلانها، وإعلان ميعاد التنازل عن الترشح وإجراءاته.

- وضع الإجراءات التيسيرية اللازمة لتمكين الأشخاص ذوي الإعاقة من الإدلاء بأصواتهم في الاستفتاءات والانتخابات.

- وضع مدونة للسلوك الانتخابي تكون ملزمة لكل من المترشحين والأحزاب السياسية ومؤيديهم وتحدد الجزاءات المترتبة على مخالفتها.

- إعلان نتيجة الاستفتاءات والانتخابات.

- إبداء الرأي في مشروعات القوانين ذات الصلة بالاستفتاءات والانتخابات الرئاسية، والنيابية، والمحلية.''',
                    style: TextStyle(
                        fontSize: 18.0,
                        color: Colors.grey.shade600
                    ),
                  ),
                  const SizedBox(height: 32.0),
                  Text(
                    '''التعاون الدولي:

    تهتم الهيئة بموضوعات التعاون الدولي في مجال الانتخابات، إدراكا منها لأهمية اكتساب الخبرات الدولية في هذا المجال، والعمل على مواكبة أحدث التطورات والتجارب المقارنة سيما وإن قانون الهيئة قد أوجب أن يتم تنفيذ الاستفتاءات والانتخابات بمراعاة القواعد المتعارف عليها دوليا في هذا المجال، وكذلك مراعاة من الهيئة لأهمية المتابعة الدولية للانتخابات ، وما تتيحه هذه المتابعة من استخلاص التقييمات الدولية المحايدة عن العملية الانتخابية.وقد نص قانون الهيئة في هذا الإطار على اختصاصها باقتراح إبرام الاتفاقيات التي تدخل في نطاق عملها، والتعاون مع المنظمات والجهات الدولية المتخصصة والعاملة في مجال عمل الهيئة.

    وتسمح القوانين المنظمة للانتخابات والاستفتاءات في مصر بمتابعة المنظمات الدولية والأجنبية لهذه الانتخابات والاستفتاءات، كما يجوز للهيئة أن توجه الدعوة لوفود من منظمات أو هيئات دولية أو إقليمية لمتابعة الانتخابات والاستفتاءات التي تجري تحت إشرافها.''',
                    style: TextStyle(
                        fontSize: 18.0,
                        color: Colors.grey.shade600
                    ),
                  ),
                  // Add more text or widgets as needed
                ],
              ),
            ),
          ),
          bottomNavigationBar: MyBottomNavigationBar(
            onHomeTabPressed: () {
              Navigator.pushReplacement(
                context,
                MaterialPageRoute(builder: (context) => HomePage()),
              );
            },
            onContactTabPressed: () {
              Navigator.pushReplacement(
                context,
                MaterialPageRoute(builder: (context) => ContactUsPage()),
              );
            },
            onMenuTabPressed: () {
              scaffoldKey.currentState!.openDrawer();
            },
          ),
          drawer: CustomDrawer.defaults(context),
        ),
        ),
      );
  }
}

